Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_efs_access_point.lambda_ap will be created
+ resource "aws_efs_access_point" "lambda_ap" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags_all        = {
          + "DeployedBy" = "Terraform"
        }

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/lambda"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "755"
            }
        }
    }

  # aws_efs_file_system.lambda_efs will be created
+ resource "aws_efs_file_system" "lambda_efs" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = "lambda-efs"
      + dns_name                = (known after apply)
      + encrypted               = false
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = "generalPurpose"
      + size_in_bytes           = (known after apply)
      + tags_all                = {
          + "DeployedBy" = "Terraform"
        }
      + throughput_mode         = "bursting"

      + protection (known after apply)
    }

  # aws_efs_mount_target.efs_mount will be created
+ resource "aws_efs_mount_target" "efs_mount" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-04e8b4750edd74d6c"
    }

  # aws_lambda_function.render_video will be updated in-place
~ resource "aws_lambda_function" "render_video" {
        id                             = "render_video"
      ~ image_uri                      = "481665084477.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:ce61feed21ec0ffd79c801817f87271cddcdc1ac4c500b4ac53fe96d5c7f17a1" -> "481665084477.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:178d0a89b62e44354be3cd77fc527e3b1404d7eff4143138aaa05d78e01f6c78"
      ~ last_modified                  = "2025-03-16T00:03:29.000+0000" -> (known after apply)
        tags                           = {}
        # (26 unchanged attributes hidden)

      + file_system_config {
          + arn              = (known after apply)
          + local_mount_path = "/mnt/efs"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-003032d1214f56b1d",
            ]
          + subnet_ids                  = [
              + "subnet-04e8b4750edd74d6c",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.efs_sg will be created
+ resource "aws_security_group" "efs_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for EFS mount for Lambda"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2049
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "efs_lambda_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "DeployedBy" = "Terraform"
        }
      + vpc_id                 = "vpc-032fa89d4525841f0"
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```
Plan: 4 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```